{

    "Header.Item1" : "About me",
    "Header.Item2" : "Experience",
    "Header.Item3" : "Projects",
    "Header.Item4" : "Contact",
    "Header.cvBtn" : "Resume",
    "Header.cvName": "AlexanderDeMesa_Resume.pdf",

    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": "I have <span class='underline'>{{years}}+ years of experience</span> developing systems, interfaces, and technological solutions, as well as providing support to enhance web functionality. My expertise lies in supporting and refactoring clean, reusable, and scalable code using <span class='underline'>Angular</span> and <span class='underline'>Ionic Framework</span> for mobile development. I prioritize delivering robust and maintainable code that meets client requirements and improves user experience.",
    "Banner.ActionBtn": "Get in touch",

    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
        "In my <span class='underline'>{{years}}+ years of experience</span>, I've taken on many roles, including  <span class='underline'>Frontend Developer</span>, <span class='underline'>Maintenance Lead</span>, and <span class='underline'>Technical Analyst</span>. I am passionate about using my knowledge to create innovative solutions that address various challenges. My capabilities extend to implementing system improvements, optimizing websites, standardizing patterns, and proposing and executing ideas that enhance project value.",
        "I am committed to ensuring seamless integration and functionality, providing ongoing support and timely updates to meet evolving client needs. My approach includes thorough documentation and transparent communication, keeping clients informed and involved throughout the development process.",
        "Some of the technologies I have trained and worked with include, but are not limited to:"
    ],


    "Experience.Title": "Experience",
    "Experience.Jobs": [
        
        {
            "Tab": "LeenTech Network Solution",
            "Title": "Jr Software Engineer",
            "Date": "January 2019 - January 2021",
            "Description": [
                "Developed 2 mobile and web applications using Agile Development methodology, delivering projects on time with 95% client satisfaction.",
                "Maintained and supported 5 mobile/system applications, reducing bug reports by 40% through proactive monitoring and optimization.",
                "Created 2 e-commerce websites using WordPress and Pure PHP framework.",
                "Programmed 20+ custom functions and plugins for WordPress platforms, improving site functionality and user experience by 35%.",
                "Delivered comprehensive technical reports for 3 client meetings, facilitating clear communication and project alignment."
            ]
      },
      {
            "Tab": "Accenture Inc",
            "Title": "Software Engineer Team Lead/Specialist",
            "Date": "April 2021 - Present",
            "Description": [
              "Led a team of 1-3 developers in creating and maintaining healthcare mobile applications serving 50,000+ users across multiple platforms.",
              "Successfully integrated 7+ third-party systems into mobile apps using Angular/Ionic framework, improving functionality by 60%.",
              "Developed and maintained Salesforce CRM system (Mobile side) managing 100,000+ patient records with 99.9% uptime and HIPAA compliance.",
              "Implemented Google Analytics 4 for healthcare apps, providing insights that improved user engagement by 45%.",
              "Conducted 100+ planning meetings and delivered detailed reports, ensuring alignment with client needs and project milestones.",
              "Served as maintenance lead for 5+ healthcare applications, reducing critical bugs by 50% and improving app performance by 30%."
            ]
        },
        {
            "Tab": "Freelancer",
            "Title": "Independent",
            "Date": "May 2019 - Present",
            "Description": [
              "Successfully delivered 10+ projects for international clients, implementing continuous improvements across frontend and backend systems.",
              "Architected and developed 5+ platforms using Angular, Laravel, Python, and WordPress with functional, reactive, and object-oriented programming paradigms.",
              "Integrated Arduino hardware with software applications, creating 5+ IoT solutions for automation and data monitoring.",
              "Designed responsive layouts using SASS, Bootstrap, and Materialize for 25+ websites, ensuring cross-browser compatibility and mobile responsiveness.",
              "Provided ongoing maintenance for 20+ existing applications (WordPress, Ionic Framework), achieving 98% client retention rate.",
              "Built scalable systems using Laravel and PHP framework, handling 10,000+ daily active users with optimized database queries."
            ]
        }
       
    ],

    "FeatureProjects.Title": "My projects",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [{
        "Title": "Get Stylin",
        "Description": "Official platform for <span class='underline'>Cincinnati Fashion Week™</span>, a comprehensive fashion community mobile application available on iOS and Android. Features include personal stylist support, community forums, Astrostyle Horoscopes, fashion editorials, exclusive event coverage streaming, and ticket purchasing. Built to provide an all-access pass to fashion week events with real-time catwalk coverage and red carpet streaming.",
        "imgs": [
        "assets/images/project_v2/getstylin.png"
        ],
        "demoLink": "https://getstylin.com/",
        "Technologies": ["Mobile App", "Angular", "Ionic Framework", "iOS", "Android", "Streaming"]
        },
        
        {
          "Title": "DIMA Health Technology",
          "Description": "FDA-licensed online pharmacy and telehealth platform providing discreet healthcare services. Features include <span class='underline'>online consultations with licensed doctors</span>, prescription management, same-day delivery, and specialized treatments for weight loss, hair loss, hormone therapy, mental health, and birth control. Complete e-commerce integration with secure payment processing and HIPAA-compliant patient data management.",
          "imgs": [
              "assets/images/project_v2/dima.png"
          ],
          "demoLink": "https://dima.ph/",
          "Technologies": ["E-commerce", "Shopify", "Healthcare", "Payment Integration", "CRM"]
        },
        
        {
          "Title": "SiglaSHOP",
          "Description": "E-commerce platform (formerly Sigla PH) providing a complete online shopping experience. Features product catalog management, <span class='underline'>shopping cart functionality</span>, secure checkout process, order tracking, and inventory management. Built to deliver a seamless shopping experience for customers with responsive design and modern UI/UX.",
          "imgs": [
              "assets/images/project_v2/siglashop.png"
          ],
          "demoLink": "https://siglashop.com/",
          "Technologies": ["E-commerce", "Shopify", "Payment Gateway", "Inventory Management", "Laravel"]
        },
        {
            "Title": "FusionTech Manila (Korean Mama PH)",
            "Description": "E-commerce platform specializing in Korean products and merchandise. Features include <span class='underline'>product categorization</span>, online ordering system, shopping cart, customer account management, and order tracking. Integrated with GoDaddy's website builder for seamless content management and product updates.",
            "imgs": [
                "assets/images/project_v2/fusiontech.png"
            ],
            "demoLink": "https://koreanmamaph.com/shop",
            "Technologies": ["E-commerce", "GoDaddy", "Online Store", "Product Management", "WordPress"]
        },
        {
            "Title": "MyCare Overseas (TRICARE)",
            "Description": "Healthcare portal for TRICARE Overseas Program serving military beneficiaries. Secure login system providing access to <span class='underline'>healthcare benefits management</span>, appointment scheduling, claims tracking, and medical services coordination. Built on Salesforce platform with robust security and compliance with healthcare regulations.",
            "imgs": [
                "assets/images/project_v2/mycare_overseas.png"
            ],
            "demoLink": "https://top.my.site.com/beneficiary/BENE_Portal#/login",
            "Technologies": ["Salesforce", "Healthcare", "Portal", "Security", "HIPAA Compliance", "Angular", "Ionic Framework", "Mobile App", "iOS", "Android"]
        },
        {
            "Title": "Attentive Health",
            "Description": "Corporate wellness and health benefits platform serving brokers and employers. Features include <span class='underline'>employee health management</span>, wellness program tracking, benefits administration, and outcome improvement tools. Available on iOS and Android with secure authentication and user portal for accessing health resources and tracking wellness goals.",
            "imgs": [
                "assets/images/project_v2/attentive.png"
            ],
            "demoLink": "https://www.beattentive.com/login",
            "Technologies": ["Healthcare", "Wellness Platform", "Mobile App", "iOS", "Android", "Portal", "Vue3", "Ionic Framework"]
        },
        {
            "Title": "Incent Wellness",
            "Description": "Comprehensive wellness incentive platform designed to promote employee health and engagement. Provides <span class='underline'>wellness program management</span>, health tracking, incentive rewards system, and personalized health goals. Mobile application available on iOS and Android for easy access to wellness activities, progress tracking, and earning rewards for healthy behaviors.",
            "imgs": [
                "assets/images/project_v2/incentwellness.png"
            ],
            "demoLink": "https://www.incentwellness.com/login",
            "Technologies": ["Wellness Platform", "Mobile App", "iOS", "Android", "Rewards System", "Health Tracking", "Vue3", "Ionic Framework"]
        }
    ],



    "OtherProjects.Title": "More projects",
    "OtherProjects.Projects": [{
            "Title": "Pokemon",
            "Description": "Pokemon search engine that uses the pokeapi. Object-oriented programming was used to organize the information of the pokemons along with their respective image.",
            "ghLink": "https://github.com/andresjosehr/pokemon-angular",
            "demoLink": "https://projects.andresjosehr.com/pokemon-list",
            "Technologies": ["Angular", "RxJs", "API", "Bootstrap"]
        },
        {
            "Title": "Coming soon page",
            "Description": "Personal project of a two-column split page to be used as a 'Coming soon page'. Scheduled to be a fully responsive design. It has a form field to subscribe by email.",
            "ghLink": "https://github.com/andresjosehr/coming-soon-page",
            "demoLink": "https://projects.andresjosehr.com/coming-soon-page",
            "Technologies": ["Angular", "SASS", "CSS GRID", "Reactive form"]
        },
        {
            "Title": "Four card feature section",
            "Description": "A single page that has a minimal design, listing four features on four cards. Input animations are done with angular animations.",
            "ghLink": "https://github.com/andresjosehr/fourd-card-feature-section",
            "demoLink": "https://projects.andresjosehr.com/four-card-feature-section",
            "Technologies": ["Angular", "SASS", "CSS GRID"]
        },
        {
            "Title": "Social proof section",
            "Description": "Personal project of a page designed from a Figma layout. Angular was used for development together with SASS and CSS GRID.",
            "ghLink": "https://github.com/andresjosehr/social-proof-section",
            "demoLink": "https://projects.andresjosehr.com/social-proof-section",
            "Technologies": ["Angular", "CSS GRID", "GIT"]
        },
        {
            "Title": "FAQ accordion card",
            "Description": "FAQ accordion with logic and animations made in Angular.",
            "ghLink": "https://github.com/andresjosehr/faq-accordion",
            "demoLink": "https://proyectos.andresjosehr.com/faq-accordion",
            "Technologies": ["Angular", "CSS GRID", "Angular animations"]
        },
        {
            "Title": "Profile card",
            "Description": "Simple one-page design that features a profile letter with basic information about a person.",
            "ghLink": "https://github.com/andresjosehr/profile-card-component",
            "demoLink": "https://proyectos.andresjosehr.com/profile-card-component",
            "Technologies": ["Angular", "SASS", "GIT"]
        }
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
    "Contact.Btn": "Say Hello"


}
